/*Завдання№6 Модульна Контрольна Робота№1 
 "Задані гіпотенуза і один з катетів прямокутного трикутника. Знайти другий
 його катет і площу трикутника. "


*/
#include <stdio.h>//Підключаємо необхідні для роботи бібліотеки 
#include <math.h>

int main() {//Оголошуємо змінні
    float hypotenuse, leg1, leg2, area;

    printf("Введіть значення гіпотенузи: ");//Просимо юзера ввести значення гіпотенузи
    if (scanf_s("%f", &hypotenuse) != 1 || hypotenuse <= 0) {//перевірка коректність введених данних
        printf("Некоректне значення гіпотенузи.\n");//Виводимо помилку на екран юзера у разі некоректних данних
        return 1;
    }

    printf("Введіть значення одного з катетів: ");//Просимо юзера ввести значення одного з каттів
    if (scanf_s("%f", &leg1) != 1 || leg1 <= 0 || leg1 >= hypotenuse) {//Перевірка на коректність данних
        printf("Некоректне значення катета.\n");//Виводимо помилку на екран юзера у разі некоректних данних
        return 1;
    }

    // Обчислення другого катета
    leg2 = sqrt(pow(hypotenuse, 2) - pow(leg1, 2));

    // Перевірка на існування трикутника
    if (isnan(leg2)) {
        printf("Трикутник з такими значеннями не існує.\n");//Виводимо помилку на екран юзера у разі якщо трикутник не може існувати
        return 1;
    }

    // Обчислення площі трикутника
    area = 0.5 * leg1 * leg2;

    printf("Другий катет: %.2f\n", leg2);
    printf("Площа трикутника: %.2f\n", area);//Виводимо данні на екран юзера

    return 0;//Кінець програми
}